benchmarks/phase2/acc_2026-05-22T200425Z.log
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x727a2db4c4a0>, trust_remote_code=False, seed=0, num_prompts=200, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=256, random_output_len=256, random_range_ratio='0.0', random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='openai', base_url='http://localhost:8000', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=1, model='DSV4-W4A16-FP8-MTP-PHASE2', input_len=None, output_len=None, tokenizer='/scratch/weights/w4a16-fp8-mtp-gptq', tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, disable_tqdm=False, num_warmups=0, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=None, result_dir='/tmp/bench_phase2', result_filename='acc_2026-05-22T200425Z.json', ignore_eos=False, percentile_metrics=None, metric_percentiles='99', goodput=None, request_id_prefix='bench-ce7ccbfc-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
INFO 05-22 20:07:21 [config.py:801] Detected quantization_config.scale_fmt=ue8m0; enabling UE8M0 for DeepGEMM.
INFO 05-22 20:07:22 [utils.py:90] Sampling input_len from [256, 256] and output_len from [256, 256]
WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 1
100%|██████████| 200/200 [05:34<00:00,  1.67s/it]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     200       
Failed requests:                         0         
Maximum request concurrency:             1         
Benchmark duration (s):                  334.14    
Total input tokens:                      51200     
Total generated tokens:                  51200     
Request throughput (req/s):              0.60      
Output token throughput (tok/s):         153.23    
Peak output token throughput (tok/s):    100.00    
Peak concurrent requests:                2.00      
Total token throughput (tok/s):          306.46    
---------------Time to First Token----------------
Mean TTFT (ms):                          148.33    
Median TTFT (ms):                        144.33    
P99 TTFT (ms):                           168.46    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          5.97      
Median TPOT (ms):                        5.96      
P99 TPOT (ms):                           6.46      
---------------Inter-token Latency----------------
Mean ITL (ms):                           10.13     
Median ITL (ms):                         10.06     
P99 ITL (ms):                            14.90     
---------------Speculative Decoding---------------
Acceptance rate (%):                     69.94     
Acceptance length:                       1.70      
Drafts:                                  30058     
Draft tokens:                            30058     
Accepted tokens:                         21024     
Per-position acceptance (%):
  Position 0:                            69.94     
==================================================